[
  {
    "eventName": "Fault Analyzer",
    "eventTime": "18th Oct, 11:00 AM",
    "eventVenue": "NLHC",
    "eventDescription": "Fault Analyzer is an engaging competition where participants put their electrical knowledge to the test by identifying and fixing faults in circuits. Teams of 2-3 members will navigate through three exciting rounds that challenge their understanding of electrical components, fault analysis, and circuit applications. Points are awarded for both speed and accuracy, with winners declared based on their overall performance.",
    "eventPosterUrl": "https://res.cloudinary.com/dnywj3xrl/image/upload/v1729001166/14_qjnlcg.png"
  },
  {
    "eventName": "AI of God 3.0",
    "eventTime": "19th Oct, 02:00 PM",
    "eventVenue": "NLHC 1",
    "eventDescription": "Merge machine learning with computer vision. Develop AI systems to recognize and analyse images from past and present. Focus on tasks like: distinguishing between images from different eras, colorizing black-and-white images, identifying objects from various historical periods",
    "eventPosterUrl": "https://res.cloudinary.com/dnywj3xrl/image/upload/v1729001159/1_bussmh.png"
  },
  {
    "eventName": "Mathalon",
    "eventTime": "18th Oct,02:00 PM",
    "eventVenue": "M&C Conference Hall, Science Block",
    "eventDescription": "Mathalon is an exhilarating competition that pushes participants to their numerical limits, testing their arithmetic, algebra, geometry, aptitude, riddles, and reasoning skills. Teams of three will compete in a series of challenging rounds designed to showcase their mathematical prowess.",
    "eventPosterUrl": "https://res.cloudinary.com/dnywj3xrl/image/upload/v1729001157/28_mp9svt.png"
  },
  {
    "eventName": "Code Conquest",
    "eventTime": "20th Oct,02:00 PM",
    "eventVenue": "NLHC",
    "eventDescription": "Welcome to the ultimate coding challenge, where creativity meets technical prowess! This competition is designed to test your coding skills, problem-solving abilities, and teamwork in a thrilling environment. Participants from various colleges and specializations are invited to form teams and compete for the top position.",
    "eventPosterUrl": "https://res.cloudinary.com/dnywj3xrl/image/upload/v1729001166/13_em5dz5.png"
  },
  {
    "eventName": "GeoGuesser",
    "eventTime": "18th Oct,01:00 PM",
    "eventVenue": "Computer Center, NLHC, IIT ISM Dhanbad",
    "eventDescription": "GeoGuesser is an exciting 90-minute competition designed to foster geographical and geological knowledge among earth enthusiasts. Participants will test their knowledge of geologically significant landmarks by guessing their locations based on provided images and marking them on Google Earth. The event encourages collaboration, precision, and accuracy in identifying famous natural landmarks around the globe. Teams will be scored based on the accuracy of their guesses.",
    "eventPosterUrl": "https://res.cloudinary.com/dnywj3xrl/image/upload/v1729001158/29_wxjcp5.png"
  },
  {
    "eventName": "Elemental Odyssey",
    "eventTime": "20th Oct,02:00 PM",
    "eventVenue": "NLHC",
    "eventDescription": "Elemental Odyssey is an exciting two-round competition that brings together knowledge and strategy, centered around minerals, metals, and their real-world and fictional applications. Participants will engage in a unique quiz and a card game, testing their wits and strategic thinking. This event provides a platform for students passionate about minerals and metals to showcase their skills in an engaging and competitive environment.",
    "eventPosterUrl": "https://res.cloudinary.com/dnywj3xrl/image/upload/v1729001160/33_yvejkg.png"
  },
  {
    "eventName": "Seek the Civil Geek",
    "eventTime": "18th Oct,01:00 PM",
    "eventVenue": "NLHC",
    "eventDescription": "Seek the Civil Geek invites aspiring engineers to tackle real-world challenges through case studies provided by prestigious companies. Participants will analyze intricate civil engineering problems, propose innovative solutions, and present their findings to a distinguished panel of judges. This competition offers a platform for students to showcase their problem-solving skills and deepen their understanding of the civil engineering field.",
    "eventPosterUrl": "https://res.cloudinary.com/dnywj3xrl/image/upload/v1729001193/34_ouylj3.png"
  },
  {
    "eventName": "Archway",
    "eventTime": "18th Oct,09:00 AM",
    "eventVenue": "NLHC",
    "eventDescription": "Archway-Arena is an engaging hands-on competition for aspiring engineers, where participants will design and construct a bridge framework using spaghetti sticks. The challenge is to create a structure that can withstand substantial loads, simulating real-world engineering challenges. This event offers a unique opportunity to blend creativity with engineering principles, fostering innovation and teamwork.",
    "eventPosterUrl": "https://res.cloudinary.com/dnywj3xrl/image/upload/v1729001154/35_wtzkyv.png"
  },
  {
    "eventName": "Logic Mania",
    "eventTime": "20th Oct,02:00 PM",
    "eventVenue": "NLHC",
    "eventDescription": "Logic Mania is an exciting competition where participants solve a series of logic equations using a limited set of logic gates. Teams are challenged to find the most cost-effective solutions while enhancing their logical thinking and problem-solving skills.",
    "eventPosterUrl": "https://res.cloudinary.com/dnywj3xrl/image/upload/v1729001165/12_apun7k.png"
  },
  {
    "eventName": "Retro Rover",
    "eventTime": "20th Oct,10:00 AM",
    "eventVenue": "NLHC",
    "eventDescription": "The Rover Modeling Competition challenges participants to design and model a space land rover using SolidWorks, drawing inspiration from renowned rovers like Curiosity, Perseverance, and Pragyan. The competition consists of two rounds: designing individual parts and assembling those parts into a functional rover.",
    "eventPosterUrl": "https://res.cloudinary.com/dnywj3xrl/image/upload/v1729001165/11_dt4wnn.png"
  },
  {
    "eventName": "Crack the Crude Code",
    "eventTime": "18th Oct,09:00 AM",
    "eventVenue": "Beside GJLT",
    "eventDescription": "Crack the Crude Code is a hands-on engineering challenge that tests participants' creativity, problem-solving skills, and understanding of mechanical separation principles in petroleum engineering. Teams of 1-4 members will construct a functional shale shaker model using basic materials to filter impurities from a mixture. This event simulates real-world challenges faced in the oil and gas industry, encouraging participants to innovate and think critically while working under time constraints.",
    "eventPosterUrl": "https://res.cloudinary.com/dnywj3xrl/image/upload/v1729001155/36_fxsw45.png"
  },
  {
    "eventName": "PetroMaze",
    "eventTime": "20th Oct,10:00 AM",
    "eventVenue": "PET 1,2 Petro. Dept.",
    "eventDescription": "An exciting crossword puzzle competition where teams will test their knowledge of the energy sector! Decode clues related to general knowledge, renewable energy, and emerging technologies, all while racing against the clock. Gather your friends for a fun and challenging event that sharpens your thinking and problem-solving skills.",
    "eventPosterUrl": "https://res.cloudinary.com/dnywj3xrl/image/upload/v1729001156/37_nx9dot.png"
  },
  {
    "eventName": "Nirvana",
    "eventTime": "",
    "eventVenue": "",
    "eventDescription": "",
    "eventPosterUrl": "https://res.cloudinary.com/dnywj3xrl/image/upload/v1729001156/38_ftfw8h.png"
  },
  {
    "eventName": "Ranneeti",
    "eventTime": "19th Oct, 02:00 PM",
    "eventVenue": "Management Hall",
    "eventDescription": "Teams will analyze, strategize, and present solutions to a real-world business case to a panel of judges. The competition emphasizes creativity, practical implementation, and strategic thinking in management decisions.",
    "eventPosterUrl": "https://res.cloudinary.com/dnywj3xrl/image/upload/v1729001162/32_kuixfk.png"
  },
  {
    "eventName": "The Urban Pulse",
    "eventTime": "20th Oct, 02:00 pM",
    "eventVenue": "Conference Hall, Enviro.Dept.",
    "eventDescription": "The Smart Cities Innovation Challenge invites participants to creatively address urban planning and sustainability challenges, promoting innovative and eco-friendly solutions for the cities of tomorrow.",
    "eventPosterUrl": "https://res.cloudinary.com/dnywj3xrl/image/upload/v1729001159/31_v7g0ld.png"
  },
  {
    "eventName": "Chem-e-Code",
    "eventTime": "18th Oct,10:00 AM",
    "eventVenue": "NLHC 2",
    "eventDescription": "CHEM-E-CODE is a competitive coding event tailored  for engineers, combining computational problem-solving with real-world chemical engineering scenarios. The event challenges participants to develop algorithmic solutions for problems related to chemical processes, reaction optimization, and plant operations. It aims to test the participants' programming skills while reinforcing their understanding of core chemical engineering principles.",
    "eventPosterUrl": "https://res.cloudinary.com/dnywj3xrl/image/upload/v1729001158/30_i9smy2.png"
  },
  {
    "eventName": "Ascension Arcade",
    "eventTime": "20th Oct,02:00 PM",
    "eventVenue": "NLHC",
    "eventDescription": "AscensionArcade is an exciting hacking competition designed to test your cybersecurity skills! In Round 1, participants will engage in a command-line-based game, learning essential cybersecurity theory while tackling various challenges. The top teams will advance to Round 2, an onsite hacking challenge where teams will compete to solve as many challenges as possible in the least amount of time. This event offers a platform to showcase your technical skills, creativity, and originality.",
    "eventPosterUrl": "https://res.cloudinary.com/dnywj3xrl/image/upload/v1729001169/19_djntul.png"
  },
  {
    "eventName": "Electro Design Battle 2.0",
    "eventTime": "19th Oct, 09:00 AM",
    "eventVenue": "NLHC 3",
    "eventDescription": "VisionForge 48 is a 48-hour design challenge where you will create innovative and user-friendly UI/UX designs based on given prompts or themes. The challenge encourages creativity, problem-solving, and practical design skills. Unleash your creative mind and solve the problems of the real world!",
    "eventPosterUrl": "https://res.cloudinary.com/dnywj3xrl/image/upload/v1729001168/17_kqtjqb.png"
  },
  {
    "eventName": "CodeRapido",
    "eventTime": "20th Oct, 09:00 AM",
    "eventVenue": "Library",
    "eventDescription": "CODERapido is a 200-minute mini-hackathon designed to foster innovation and teamwork among developers. Teams of 1-3 members will compete to create a small game based on a theme revealed at the start of the event. Participants have the freedom to choose any tech stack they prefer. The event aims to encourage collaborative problem-solving, stimulate creative thinking under time constraints, and provide a platform for showcasing technical skills. Teams will develop their projects within the given time frame and present them to a panel of judges for evaluation.",
    "eventPosterUrl": "https://res.cloudinary.com/dnywj3xrl/image/upload/v1729001169/21_v9bssa.png"
  },
  {
    "eventName": "CryptoGuard CTF",
    "eventTime": "19th Oct, 12:00 PM",
    "eventVenue": "Library",
    "eventDescription": "CryptoGuard is an exciting multi-level Capture the Flag (CTF) competition focused on trending Web3 security challenges. Participants will put their hacking skills to the test by exploiting vulnerabilities in Ethereum smart contracts deployed on the EVM (Ethereum Virtual Machine)",
    "eventPosterUrl": "https://res.cloudinary.com/dnywj3xrl/image/upload/v1729001219/22_rysr6i.png"
  },
  {
    "eventName": "Cosmolligence 2.O",
    "eventTime": "19th Oct, 10:00 AM",
    "eventVenue": "NHLC",
    "eventDescription": "This hackathon focuses on the latest trends in Machine Learning, allowing participants to tackle innovative challenges and showcase their skills. There are multiple tracks for participants to choose from, each focusing on different areas of machine learning. The problem statements for the tracks will be revealed four hours before the event starts.",
    "eventPosterUrl": "https://res.cloudinary.com/dnywj3xrl/image/upload/v1729001156/26_a3lxit.png"
  },
  {
    "eventName": "Masterstack 3.0",
    "eventTime": "18th Oct, 10:00 AM",
    "eventVenue": "NLHC 1",
    "eventDescription": "MasterStack 3.0 is a team-based hackathon designed to foster innovation and teamwork among developers. Teams of 3-5 members will compete to create functional applications based on any problem statement chosen by them. Teams will be provided with a fixed budget to buy tech stacks and get corresponding points for using that tech stack. The event provides a platform to showcase the technical skills along with their creativity and originality. Teams will submit a proposal beforehand stating their problem statement and briefing their solutions. They will be presenting the final solution before a panel of judges.",
    "eventPosterUrl": "https://res.cloudinary.com/dnywj3xrl/image/upload/v1729001160/27_nmrdl5.png"
  },
  {
    "eventName": "Hack the Block",
    "eventTime": "19th Oct, 12:00 PM",
    "eventVenue": "Library",
    "eventDescription": "Hack the Block is an exciting three-round competition sponsored by Grull designed to explore the potential of blockchain and Web3 technology while fostering innovation and collaboration among participants. The event kicks off with an engaging online quiz that tests your knowledge of blockchain fundamentals, its applications, and current trends in the field. Top performers will advance to the second round, where they'll receive a specific problem statement and be tasked with proposing innovative solutions that leverage blockchain technology. This round is designed to encourage creative thinking and teamwork, and it's non- eliminating, allowing all participants to showcase their ideas.",
    "eventPosterUrl": "https://res.cloudinary.com/dnywj3xrl/image/upload/v1729001162/5_pefljm.png"
  },
  {
    "eventName": "AptiQuest",
    "eventTime": "18th Oct, 11:00 AM",
    "eventVenue": "NLHC 3",
    "eventDescription": "This is a offline, individual competition designed to test your mental calculation skills.",
    "eventPosterUrl": "https://res.cloudinary.com/dnywj3xrl/image/upload/v1729001163/6_odygks.png"
  },
  {
    "eventName": "AlgoVerse",
    "eventTime": "18th Oct, 12:00 AM",
    "eventVenue": "On Campus",
    "eventDescription": "The Algoverse competition invites participants to showcase their quantitative analysis skills by designing and implementing a trading strategy for Bitcoin and Ethereum during a 12-hour hackathon.",
    "eventPosterUrl": "https://res.cloudinary.com/dnywj3xrl/image/upload/v1729001164/8_harntn.png"
  },
  {
    "eventName": "Trade-a-Thon",
    "eventTime": "",
    "eventVenue": "Online",
    "eventDescription": "Description:\nRisk-free environment simulating the dynamics of Dalal Street\nDesigned for participants to develop and refine trading skills before real-life trading\nCash rewards for top traders\nOne round only; highest net worth at the end wins",
    "eventPosterUrl": "https://res.cloudinary.com/dnywj3xrl/image/upload/v1729001164/7_gjhcq1.png"
  },
  {
    "eventName": "Let them Cook",
    "eventTime": "18th Oct, 12:30 PM",
    "eventVenue": "NLHC 2",
    "eventDescription": "The ‘Let Them Cook’ Startup Ideation Challenge, organized by E-Cell, is designed to ignite creativity and entrepreneurial spirit. Teams will compete by receiving industry-specific “ingredients” to spark innovative startup ideas. After an intense ideation phase, teams will pitch their concepts to a panel of judges, with a chance to win exciting prizes and receive valuable feedback.",
    "eventPosterUrl": "https://res.cloudinary.com/dnywj3xrl/image/upload/v1729001164/9_wph713.png"
  },
  {
    "eventName": "Bizathon 2.0",
    "eventTime": "19th Oct, 01:00 PM",
    "eventVenue": "NLHC",
    "eventDescription": "Bizathon is an exciting platform for innovative minds to transform groundbreaking ideas into reality.\n\n",
    "eventPosterUrl": "https://res.cloudinary.com/dnywj3xrl/image/upload/v1729001165/10_lcbalr.png"
  },
  {
    "eventName": "Space Sprint",
    "eventTime": "19th Oct,10:00 AM",
    "eventVenue": "SAC",
    "eventDescription": "Prepare to embark on an epic robotic adventure! The Space Sprint challenges participants to design, build, and program innovative rovers capable of conquering challenging terrains. This two-round competition tests the limits of creativity, engineering, and problem-solving skills. Participants will face a series of obstacle courses with varying levels of difficulty, from navigating intricate pathways to overcoming steep inclines. Only the most resilient and intelligent rovers will emerge victorious.",
    "eventPosterUrl": "https://res.cloudinary.com/dnywj3xrl/image/upload/v1729001167/15_onehxw.png"
  },
  {
    "eventName": "Sky is the Limit",
    "eventTime": "18th Oct, 10:00 AM",
    "eventVenue": "Lower Ground",
    "eventDescription": "Join us for \"Sky Is The Limit 3.0,\" a rocketry competition designed to foster creativity, engineering skills, and teamwork among students. Participants will design and build rockets aiming for maximum flight time. This free event encourages broad participation, showcasing innovative ideas while inspiring interest in aerospace engineering.",
    "eventPosterUrl": "https://res.cloudinary.com/dnywj3xrl/image/upload/v1729001209/23_lj7ygq.png"
  },
  {
    "eventName": "M.A.R.G. (Manual Armed Rover Game)",
    "eventTime": "20th Oct, 10:00 AM",
    "eventVenue": "NLHC Compund",
    "eventDescription": "Teams must design a manually controlled rover capable of performing tasks such as grasping blocks and placing them in target areas while navigating a predefined obstacle course.",
    "eventPosterUrl": "https://res.cloudinary.com/dnywj3xrl/image/upload/v1729001154/24_md2oyv.png"
  },
  {
    "eventName": "Chakravyu: Maze Solver",
    "eventTime": "19th Oct, 02:00 PM",
    "eventVenue": "NLHC Compound",
    "eventDescription": "This is a robotics competition where teams must design and build an autonomous robot to navigate through a maze, with rounds that test the robot's ability to reach the maze exit and its center. The competition consists of two rounds: an elimination round and a final round.",
    "eventPosterUrl": "https://res.cloudinary.com/dnywj3xrl/image/upload/v1729001155/25_acrewl.png"
  },
  {
    "eventName": "Robowars",
    "eventTime": "18th Oct, 4:00 PM",
    "eventVenue": "OAT",
    "eventDescription": "Design and construct a remote-controlled wireless robot to compete in combat matches against other teams' robots.",
    "eventPosterUrl": "https://res.cloudinary.com/dnywj3xrl/image/upload/v1729001159/2_otqltj.png"
  },
  {
    "eventName": "ProdBlitz 2.0",
    "eventTime": "19th Oct, 11:00 AM",
    "eventVenue": "Online",
    "eventDescription": "Prepare to embark on an interstellar journey into the world of product management and strategy! Join us for our exciting Product Management Case Study Competition by Product Management Club IIT (ISM) Dhanbad, where you'll face thrilling challenges that will test your skills and creativity.",
    "eventPosterUrl": "https://res.cloudinary.com/dnywj3xrl/image/upload/v1729001161/4_ejyeay.png"
  },
  {
    "eventName": "Ani-Saga",
    "eventTime": "19th Oct, 8:00 AM",
    "eventVenue": "Online",
    "eventDescription": "In the ever-evolving realm of technology, our college's tech fest is excited to present an artistic challenge in 3D Modelling and Animation. We invite talented individuals to showcase their skills by crafting innovative 3D models and animations that push the limits of digital creativity. Participants will leverage advanced software to bring their imaginative designs to life, setting new standards in the field and redefining the possibilities of digital artistry.",
    "eventPosterUrl": "https://res.cloudinary.com/dnywj3xrl/image/upload/v1729001168/16_bk6gse.png"
  },
  {
    "eventName": "CodeWars",
    "eventTime": "18th Oct,09:00 AM",
    "eventVenue": "Library",
    "eventDescription": "Join the C3 SpeedCP Challenge, a fast-paced competitive programming event that tests your rapid problem-solving abilities and teamwork under tight time constraints. In teams of up to 3 members, participants will race against the clock to solve as many algorithmic problems as possible within a 2-hour window. This challenge focuses on speed and volume, featuring a series of easy to medium difficulty problems.",
    "eventPosterUrl": "https://res.cloudinary.com/dnywj3xrl/image/upload/v1729001168/18_xg39en.png"
  }
]